КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_УИДыГИС/КонтурЛогистика_УИДыГИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_УИДыГИС</name>
  <comment>Хранит пул доступных для использования УИДов минтранса</comment>
  <resources>
    <name>Использован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОперации</name>
    <comment>Дата операции добавления / использования</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_УИДыГИС/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ЛоадерЗагрузитьУИДы.Видимость 	= Ложь;

	Отбор = "Все";
	
	ПериодАктуальностиУИД = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПериодАктуальностиУИД");
	Список.Параметры.УстановитьЗначениеПараметра("ПериодАктуальностиУИД", ПериодАктуальностиУИД);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПулИзApi(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"РегистрСведений.КонтурЛогистика_УИДыГИС.Форма.ФормаЗагрузкиПулаУИДИзApi",, ЭтаФорма, ЭтаФорма, "ОбработчикПослеВводаКоличестваУИДов");
			
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПослеВводаКоличестваУИДов(Результат, ДопПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда 
		Возврат; // отмена
	КонецЕсли;
	
	КоличествоУИДов = Результат.КоличествоУИДов;
	Организация = Результат.Организация;
	
	Если КоличествоУИДов < 1 Или КоличествоУИДов > 100 Тогда 
		ВызватьИсключение "Введено некорректное количество УИДов для загрузки";
	КонецЕсли;	
	
	ЗапуститьЗагрузкуУИДовПоApi(КоличествоУИДов, Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьЗагрузкуУИДовПоApi(КоличествоУИДов = 10, Организация)

	РезультатЗапуска = КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеЗадание(
						"КонтурЛогистика_ДлительныеОперацииСервер.ЗагрузитьПулУИДовЧерезAPI",
						Новый Структура("КоличествоУИДов, Организация", КоличествоУИДов, Организация),
						,
						"Загрузка пула УИДов");
						
	Если РезультатЗапуска.Статус = "Выполняется" Тогда
		
		ИдентификаторФЗ_ЗагрузкаУИДовПоApi = РезультатЗапуска.ИдентификаторЗадания;
		
		Элементы.ЛоадерЗагрузитьУИДы.Видимость 	= Истина;
		Элементы.ЗагрузитьПулПоApi.Доступность 	= Ложь;
		
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗаданиеЗагрузитьПулПоApi", 0.1, Истина);
		
	ИначеЕсли РезультатЗапуска.Статус = "Выполнено" Тогда
		
		ПроверитьФоновоеЗаданиеЗагрузитьПулПоApi();
		
	КонецЕсли;					

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФоновоеЗаданиеЗагрузитьПулПоApi() Экспорт
	
	ИнтервалОбработчикаОжидания = 2;
	
	ЗаданиеЕщеВыполняется = КонтурЛогистика_ДлительныеОперацииКлиент.ОбработчикСлеженияЗаФЗ(ИдентификаторФЗ_ЗагрузкаУИДовПоApi,
		Элементы.ЛоадерЗагрузитьУИДы);
	
	Если ЗаданиеЕщеВыполняется Тогда 
		
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗаданиеЗагрузитьПулПоApi", ИнтервалОбработчикаОжидания, Истина);
		
	Иначе
		
		Элементы.ЛоадерЗагрузитьУИДы.Видимость 	= Ложь;		
		Элементы.ЗагрузитьПулПоApi.Доступность 	= Истина;
		
		Если Не Элементы.ЛоадерЗагрузитьУИДы.Видимость Тогда 		
			Элементы.Список.Обновить();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛоадерЗагрузитьУИДыНажатие(Элемент)
	
	Если ЗначениеЗаполнено(ИдентификаторФЗ_ЗагрузкаУИДовПоApi) Тогда 
		КонтурЛогистика_ДлительныеОперацииКлиент.СледитьЗаФоновымЗаданиемВФорме(ИдентификаторФЗ_ЗагрузкаУИДовПоApi, "Загрузка пула УИДов", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор()
	
	Список.Отбор.Элементы.Очистить();
	
	Если Отбор = "Доступные" Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Использован",
			Ложь, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Истекает",
			КонецДня(ТекущаяДатаСеанса()), ВидСравненияКомпоновкиДанных.БольшеИлиРавно,, Истина);
		
	ИначеЕсли Отбор = "Истекшие" Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Истекает",
			КонецДня(ТекущаяДатаСеанса()), ВидСравненияКомпоновкиДанных.Меньше,, Истина);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Использован",
			Ложь, ВидСравненияКомпоновкиДанных.Равно,, Истина);		
		
	КонецЕсли;	
		
КонецПроцедуры
